; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=246, out_folder=./training, instance_id=42, seed=2066, goal_proportion=0.03

(define (problem blocksworld-42)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 - object)
 (:init 
    (arm-empty)
    (clear b64)
    (on-table b64)
    (clear b182)
    (on b182 b33)
    (on b33 b35)
    (on b35 b131)
    (on b131 b175)
    (on b175 b41)
    (on-table b41)
    (clear b12)
    (on-table b12)
    (clear b126)
    (on b126 b219)
    (on b219 b209)
    (on b209 b142)
    (on b142 b222)
    (on b222 b103)
    (on b103 b134)
    (on b134 b206)
    (on-table b206)
    (clear b88)
    (on b88 b106)
    (on-table b106)
    (clear b40)
    (on b40 b70)
    (on b70 b207)
    (on b207 b204)
    (on b204 b80)
    (on-table b80)
    (clear b230)
    (on b230 b109)
    (on b109 b233)
    (on b233 b116)
    (on b116 b144)
    (on b144 b91)
    (on b91 b163)
    (on b163 b159)
    (on b159 b65)
    (on b65 b27)
    (on b27 b52)
    (on b52 b166)
    (on b166 b227)
    (on b227 b23)
    (on b23 b228)
    (on b228 b114)
    (on b114 b151)
    (on b151 b188)
    (on-table b188)
    (clear b10)
    (on b10 b203)
    (on-table b203)
    (clear b24)
    (on b24 b66)
    (on b66 b211)
    (on b211 b234)
    (on b234 b212)
    (on b212 b232)
    (on-table b232)
    (clear b215)
    (on b215 b156)
    (on b156 b19)
    (on b19 b155)
    (on b155 b130)
    (on b130 b246)
    (on b246 b85)
    (on b85 b99)
    (on-table b99)
    (clear b92)
    (on b92 b11)
    (on b11 b2)
    (on-table b2)
    (clear b20)
    (on b20 b14)
    (on b14 b238)
    (on b238 b223)
    (on b223 b157)
    (on b157 b28)
    (on b28 b93)
    (on b93 b34)
    (on b34 b153)
    (on b153 b117)
    (on-table b117)
    (clear b32)
    (on b32 b83)
    (on-table b83)
    (clear b15)
    (on b15 b89)
    (on-table b89)
    (clear b77)
    (on b77 b236)
    (on b236 b96)
    (on b96 b226)
    (on b226 b47)
    (on b47 b201)
    (on b201 b197)
    (on b197 b146)
    (on b146 b178)
    (on b178 b16)
    (on b16 b53)
    (on b53 b69)
    (on b69 b63)
    (on b63 b245)
    (on-table b245)
    (clear b124)
    (on-table b124)
    (clear b48)
    (on-table b48)
    (clear b38)
    (on b38 b9)
    (on b9 b72)
    (on b72 b74)
    (on b74 b168)
    (on b168 b112)
    (on b112 b173)
    (on b173 b214)
    (on-table b214)
    (clear b149)
    (on b149 b141)
    (on b141 b86)
    (on-table b86)
    (clear b118)
    (on b118 b123)
    (on-table b123)
    (clear b43)
    (on b43 b81)
    (on-table b81)
    (clear b61)
    (on b61 b26)
    (on b26 b102)
    (on b102 b224)
    (on b224 b181)
    (on b181 b22)
    (on b22 b162)
    (on-table b162)
    (clear b217)
    (on b217 b128)
    (on b128 b135)
    (on b135 b229)
    (on-table b229)
    (clear b198)
    (on b198 b190)
    (on b190 b150)
    (on b150 b46)
    (on b46 b119)
    (on b119 b221)
    (on b221 b185)
    (on-table b185)
    (clear b75)
    (on b75 b57)
    (on b57 b171)
    (on-table b171)
    (clear b1)
    (on-table b1)
    (clear b172)
    (on b172 b7)
    (on-table b7)
    (clear b87)
    (on b87 b192)
    (on-table b192)
    (clear b17)
    (on b17 b195)
    (on b195 b120)
    (on b120 b237)
    (on-table b237)
    (clear b161)
    (on-table b161)
    (clear b104)
    (on b104 b187)
    (on b187 b44)
    (on b44 b71)
    (on b71 b184)
    (on-table b184)
    (clear b18)
    (on b18 b158)
    (on b158 b179)
    (on b179 b139)
    (on b139 b54)
    (on b54 b213)
    (on-table b213)
    (clear b140)
    (on b140 b138)
    (on b138 b186)
    (on b186 b122)
    (on b122 b194)
    (on b194 b196)
    (on b196 b170)
    (on-table b170)
    (clear b111)
    (on b111 b42)
    (on-table b42)
    (clear b84)
    (on b84 b210)
    (on-table b210)
    (clear b216)
    (on b216 b73)
    (on b73 b174)
    (on b174 b241)
    (on b241 b205)
    (on b205 b29)
    (on b29 b55)
    (on b55 b244)
    (on b244 b177)
    (on b177 b121)
    (on-table b121)
    (clear b202)
    (on b202 b218)
    (on b218 b137)
    (on b137 b95)
    (on-table b95)
    (clear b50)
    (on b50 b152)
    (on b152 b143)
    (on-table b143)
    (clear b6)
    (on-table b6)
    (clear b235)
    (on b235 b5)
    (on b5 b82)
    (on b82 b78)
    (on b78 b132)
    (on b132 b199)
    (on b199 b176)
    (on b176 b240)
    (on b240 b21)
    (on b21 b189)
    (on b189 b200)
    (on b200 b164)
    (on b164 b30)
    (on b30 b39)
    (on b39 b145)
    (on-table b145)
    (clear b60)
    (on-table b60)
    (clear b79)
    (on-table b79)
    (clear b67)
    (on b67 b154)
    (on b154 b4)
    (on b4 b105)
    (on b105 b3)
    (on b3 b107)
    (on b107 b115)
    (on-table b115)
    (clear b242)
    (on b242 b193)
    (on b193 b45)
    (on-table b45)
    (clear b51)
    (on b51 b243)
    (on b243 b101)
    (on b101 b108)
    (on b108 b97)
    (on b97 b25)
    (on b25 b37)
    (on b37 b167)
    (on-table b167)
    (clear b68)
    (on b68 b125)
    (on b125 b36)
    (on-table b36)
    (clear b169)
    (on b169 b180)
    (on b180 b62)
    (on b62 b127)
    (on-table b127)
    (clear b231)
    (on b231 b148)
    (on b148 b129)
    (on-table b129)
    (clear b160)
    (on b160 b225)
    (on b225 b191)
    (on b191 b133)
    (on b133 b56)
    (on b56 b208)
    (on b208 b58)
    (on b58 b100)
    (on-table b100)
    (clear b165)
    (on b165 b94)
    (on b94 b59)
    (on-table b59)
    (clear b239)
    (on-table b239)
    (clear b136)
    (on b136 b8)
    (on b8 b220)
    (on-table b220)
    (clear b147)
    (on b147 b90)
    (on b90 b113)
    (on b113 b110)
    (on b110 b13)
    (on b13 b98)
    (on b98 b49)
    (on b49 b76)
    (on b76 b31)
    (on-table b31)
    (clear b183)
    (on-table b183))
 (:goal  (and 
    (clear b4)
    (on b4 b5)
    (on b5 b2)
    (on b2 b1)
    (on b1 b6)
    (on b6 b3)
    (on b3 b7)
    (on-table b7))))

; plan
1. (unstack b172 b7)
   deleted: (on b172 b7) (clear b172) (arm-empty)
   added: (holding b172) (clear b7)
   goals met: 1 of 8
2. (putdown b172)
   deleted: (holding b172)
   added: (clear b172) (arm-empty) (on-table b172)
   goals met: 1 of 8
3. (unstack b235 b5)
   deleted: (on b235 b5) (clear b235) (arm-empty)
   added: (holding b235) (clear b5)
   goals met: 1 of 8
4. (putdown b235)
   deleted: (holding b235)
   added: (clear b235) (arm-empty) (on-table b235)
   goals met: 1 of 8
5. (unstack b67 b154)
   deleted: (on b67 b154) (clear b67) (arm-empty)
   added: (holding b67) (clear b154)
   goals met: 1 of 8
6. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 1 of 8
7. (unstack b154 b4)
   deleted: (on b154 b4) (clear b154) (arm-empty)
   added: (holding b154) (clear b4)
   goals met: 2 of 8
8. (putdown b154)
   deleted: (holding b154)
   added: (clear b154) (arm-empty) (on-table b154)
   goals met: 2 of 8
9. (unstack b92 b11)
   deleted: (on b92 b11) (clear b92) (arm-empty)
   added: (holding b92) (clear b11)
   goals met: 2 of 8
10. (putdown b92)
   deleted: (holding b92)
   added: (clear b92) (arm-empty) (on-table b92)
   goals met: 2 of 8
11. (unstack b11 b2)
   deleted: (on b11 b2) (clear b11) (arm-empty)
   added: (holding b11) (clear b2)
   goals met: 2 of 8
12. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 2 of 8
13. (unstack b4 b105)
   deleted: (on b4 b105) (clear b4) (arm-empty)
   added: (holding b4) (clear b105)
   goals met: 1 of 8
14. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 3 of 8
15. (unstack b105 b3)
   deleted: (on b105 b3) (clear b105) (arm-empty)
   added: (holding b105) (clear b3)
   goals met: 3 of 8
16. (putdown b105)
   deleted: (holding b105)
   added: (clear b105) (arm-empty) (on-table b105)
   goals met: 3 of 8
17. (unstack b3 b107)
   deleted: (on b3 b107) (clear b3) (arm-empty)
   added: (holding b3) (clear b107)
   goals met: 3 of 8
18. (stack b3 b7)
   deleted: (clear b7) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b7)
   goals met: 4 of 8
19. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 4 of 8
20. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 5 of 8
21. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 5 of 8
22. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 6 of 8
23. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 6 of 8
24. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 7 of 8
25. (unstack b4 b5)
   deleted: (on b4 b5) (clear b4) (arm-empty)
   added: (holding b4) (clear b5)
   goals met: 5 of 8
26. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 6 of 8
27. (unstack b5 b82)
   deleted: (on b5 b82) (clear b5) (arm-empty)
   added: (holding b5) (clear b82)
   goals met: 6 of 8
28. (stack b5 b2)
   deleted: (clear b2) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b2)
   goals met: 7 of 8
29. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 6 of 8
30. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 8 of 8
